---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.GetItalicStatus
source: html/3a30affe-5cdd-1042-45ae-046c2c0d3454.htm
---
# Autodesk.Revit.DB.FormattedText.GetItalicStatus Method

Returns whether All , None or a Mixed of characters in the entire text are italic.

## Syntax (C#)
```csharp
public FormatStatus GetItalicStatus()
```

## Returns
The format status of italic on characters FormatStatus .

## Remarks
This function only returns All or None if the entire text contains one character.